//***********************************************************************
//*                                                                     *
//*   Copyright (c) 1985-2020, American Megatrends International LLC.   *
//*                                                                     *
//*      All rights reserved. Subject to AMI licensing agreement.       *
//*                                                                     *
//***********************************************************************
//=#

#langdef   en-US "English"    // English

#string STR_HSTI_IMPLEMENTATION_ID      #language en-US "AMI model version"

//  Template for strings 
//#string #language en-US "Error 0x%04X%04X - \n\r"

#string AMI_HSTI_ERROR_CRYPTO_STRENGTH      #language en-US "Error 0x%04X%04X - Crypto Strength Error\n\r"
#string AMI_HSTI_ERROR_CRYPTO_STRENGTH1     #language en-US "Error 0x%04X%04X - Crypto Strength Error. FW update Key use lower crypto standard\n\r"
#string AMI_HSTI_ERROR_CRYPTO_STRENGTH2     #language en-US "Error 0x%04X%04X - Crypto Strength Error. Secure Boot PK use lower crypto standard\n\r"

#string AMI_HSTI_ERROR_EXTERNAL_DMA          #language en-US "Error 0x%04X%04X - External DMA usage is allowed\n\r"

#string AMI_HSTI_ERROR_MOR_STRENGTH         #language en-US "Error 0x%04X%04X - Memory Overwrite Request not supported\n\r"

#string AMI_HSTI_ERROR_FIRMWARE_ROLLBACK    #language en-US "Error 0x%04X%04X - RollBack Firmware Error\n\r"

#string AMI_HSTI_ERROR_SECURE_BOOT_BYPASS   #language en-US "Error 0x%04X%04X - Secure Boot Bypass Error\n\r"

#string AMI_HSTI_ERROR_VERIFY_NO_TEST_KEY   #language en-US "Error 0x%04X%04X - Test Key Verification Error\n\r"
#string AMI_HSTI_ERROR_VERIFY_NO_TEST_KEY1  #language en-US "Error 0x%04X%04X - Test Key Verification Error. AMI Test key used in FW update verification\n\r"
#string AMI_HSTI_ERROR_VERIFY_NO_TEST_KEY2  #language en-US "Error 0x%04X%04X - Test Key Verification Error. AMI Test key used in Secure Boot Platform Key(PK)\n\r"

#string AMI_HSTI_SIGNED_FIRMWARE_UPDATE     #language en-US "Error 0x%04X%04X - Signed Firmware Update Error\n\r"
#string AMI_HSTI_SIGNED_FIRMWARE_UPDATE_WITH_DEFAULT_KEY     #language en-US "Error 0x%04X%04X - Signed Firmware Update with the Default Key Error\n\r"

#string AMI_HSTI_MANUFACTURING_MODE         #language en-US "Error 0x%04X%04X - Manufacturing Mode Back Door Error\n\r"

#string AMI_HSTI_ERROR_SECURE_BOOT_CSM_DISABLE  #language en-US "Error 0x%04X%04X - CSM Enabled while in Secure Boot Mode \n\r"
